Trisuborn/ART-PI_RT-Thread/thirdParty/rt-thread-all/bsp/stm32/libraries/HAL_Drivers/drv_common.c
/*
 * Copyright (c) 2006-2018, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2018-11-7      SummerGift   first version
 */

#include "drv_common.h"
#include "board.h"
#include "sys_conf.h"
#include "pin_wkup.h"

#ifdef RT_USING_SERIAL
#include "drv_usart.h"
#endif

#ifdef BSP_USING_GPIO
#include "drv_gpio.h"
#endif

#ifdef RT_USING_FINSH
#include <finsh.h>
static void reboot(uint8_t argc, char** argv)
{
    rt_hw_cpu_reset();
}
FINSH_FUNCTION_EXPORT_ALIAS(reboot, __cmd_reboot, Reboot System);
#endif /* RT_USING_FINSH */

/* SysTick configuration */
void rt_hw_systick_init(void)
{
#if defined (SOC_SERIES_STM32H7)
    HAL_SYSTICK_Config((HAL_RCCEx_GetD1SysClockFreq()) / RT_TICK_PER_SECOND);
#elif defined (SOC_SERIES_STM32MP1)
    HAL_SYSTICK_Config(HAL_RCC_GetSystemCoreClockFreq() / RT_TICK_PER_SECOND);
#else
    HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq() / RT_TICK_PER_SECOND);
#endif
#if !defined (SOC_SERIES_STM32MP1)
    HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);
#endif
    NVIC_SetPriority(SysTick_IRQn, 0xFF);
}

/**
 * This is the timer interrupt service routine.
 *
 */
void SysTick_Handler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_IncTick();
    rt_tick_increase();

    /* leave interrupt */
    rt_interrupt_leave();
}

// uint32_t HAL_GetTick(void)
// {
//     return rt_tick_get() * 1000 / RT_TICK_PER_SECOND;
// }

// void HAL_SuspendTick(void)
// {
// }

// void HAL_ResumeTick(void)
// {
// }

// void HAL_Delay(__IO uint32_t Delay)
// {
//     rt_thread_mdelay(Delay);
// }

/* re-implement tick interface for STM32 HAL */
// HAL_StatusTypeDef HAL_InitTick(uint32_t TickPriority)
// {
//     /* Return function status */
//     return HAL_OK;
// }

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char* s, int num)
{
    /* USER CODE BEGIN Error_Handler */
    /* User can add his own implementation to report the HAL error return state */
    while (1) {
    }
    /* USER CODE END Error_Handler */
}

/**
 * This function will delay for some us.
 *
 * @param us the delay time of us
 */
void rt_hw_us_delay(rt_uint32_t us)
{
    rt_uint32_t start, now, delta, reload, us_tick;
    start = SysTick->VAL;
    reload = SysTick->LOAD;
    us_tick = SystemCoreClock / 1000000UL;
    do {
        now = SysTick->VAL;
        delta = start > now ? start - now : reload + start - now;
    } while (delta < us_tick * us);
}

/**
 * This function will initial STM32 board.
 */

RT_WEAK void rt_hw_board_init()
{

    SCB_EnableICache();
    SCB_EnableDCache();
    
    /* HAL_Init() function is called at the beginning of the program */
    HAL_Init();

/* enable interrupt */
    __set_PRIMASK(0);
    SystemClock_Config();


    /* 开机实现 */
    __HAL_RCC_GPIOC_CLK_ENABLE();
    GPIO_InitTypeDef wkup_pin;
    wkup_pin.Mode = GPIO_MODE_INPUT;
    wkup_pin.Pin = GPIO_PIN_13;
    wkup_pin.Pull = GPIO_PULLDOWN;
    wkup_pin.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    HAL_GPIO_Init(GPIOC, &wkup_pin);
    if (wkup_pin_check(0)) {
        sys_enter_standby();
    } else {
        HAL_PWR_DisableWakeUpPin(PWR_WAKEUP_PIN3);
    }

    /* disable interrupt */
    __set_PRIMASK(1);

    rt_hw_systick_init();

    /* Heap initialization */
#if defined(RT_USING_HEAP)
    rt_system_heap_init((void*)HEAP_BEGIN, (void*)HEAP_END);
#endif


    /* Pin driver initialization is open by default */
#ifdef RT_USING_PIN
    rt_hw_pin_init();
#endif

    /* USART driver initialization is open by default */
#ifdef RT_USING_SERIAL
    rt_hw_usart_init();
#endif

    /* Set the shell console output device */
#ifdef RT_USING_CONSOLE
    rt_console_set_device(RT_CONSOLE_DEVICE_NAME);
#endif

    /* Board underlying hardware initialization */
#ifdef RT_USING_COMPONENTS_INIT
    rt_components_board_init();
#endif
}


static void boot()
{
    /* 开机实现 */
    // __HAL_RCC_GPIOC_CLK_ENABLE();
    // GPIO_InitTypeDef wkup_pin;
    // wkup_pin.Mode = GPIO_MODE_INPUT;
    // wkup_pin.Pin = GPIO_PIN_13;
    // wkup_pin.Pull = GPIO_PULLDOWN;
    // wkup_pin.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    // HAL_GPIO_Init(GPIOC, &wkup_pin);
    // if (wkup_pin_check(0)) {
    // 	__HAL_RCC_GPIOC_CLK_DISABLE();
    //     sys_enter_standby();
    // } else {
    //     HAL_PWR_DisableWakeUpPin(PWR_WAKEUP_PIN3);
    // }

    // __HAL_RCC_GPIOC_CLK_ENABLE();
    // GPIO_InitTypeDef GPIO_InitStruct = { 0 };
    // GPIO_InitStruct.Pin = GPIO_PIN_13;
    // GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    // GPIO_InitStruct.Pull = GPIO_PULLDOWN;
    // HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
    // if (HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_13) == GPIO_PIN_RESET) {
    //     HAL_PWR_DisableWakeUpPin(PWR_WAKEUP_PIN3);
    //     HAL_PWR_EnableWakeUpPin(PWR_WAKEUP_PIN3);
    //     SET_BIT(PWR->CPUCR, (PWR_CPUCR_PDDS_D2));
    //     SET_BIT(PWR->CPUCR, (PWR_CPUCR_PDDS_D1));
    //     SET_BIT(SCB->SCR, SCB_SCR_SLEEPDEEP_Msk);
    //     __DSB();
    //     __ISB();
    //     __WFI();
    // } else {
    //     HAL_PWR_DisableWakeUpPin(PWR_WAKEUP_PIN3);
    // }
}
INIT_PREV_EXPORT(boot);
